"use strict"; // включение режимы обязательного "определения"
// переменных (const или let)

// Текст задания 
// 1. Установить расширение форматирования кода
// 2. Установить расширение “JavaScript Snippet Pack”
// 3. Сделайте файл с вашей первой программой. 
// a. index.html
// b. script.js
// 4. Подключите файл script.js к index.html
// 5. В файле index.html создайте скрипт который выводит в 
// консоль текст “Текст из index.html”
// 6. В файле script.js вывести в консоль текст “Текст из 
// script.js!”

// alert('Привет');

// console.log('Текст из index.html');

// Задание 2 (тайминг 25 минут)
// Текст задания 
// 1. Создайте переменную num и присвойте ей значение 123. Выведите 
// значение этой переменной в консоль
// let num = 123;
// console.log(num);
// const num2 = 500;
// console.log(num2);

// 2. Создайте переменную а и присвойте ей значение 5, переопределите 
// переменную а на значение 7, выведите переменную а в консоль
// let a = 5;
// a = 7;
// console.log(a);

// 3. Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С 
// помощью функции console.log выведите в консоль содержимое 
// переменной b.
// const b = 1 + 2 + 3;
// console.log(b);

// 4. Создайте 2 вида комментариев в вашем коде, добавьте в них 
// произвольный текст
/* vabvadsacba */

// Задание 3 (тайминг 20 минут)
// 1. Создайте переменную c со значением 10 и переменную d со 
// значением 2.
// a. Все созданные переменные должны быть логично названы
// b. Создайте переменную суммы и присвойте сумму чисел (c,d)
// c. Создайте переменную разности и присвойте разность чисел 
// (c,d)
// d. Создайте переменную прозведения и присвойте произведение 
// чисел (c,d)
// e. Создайте переменную частного и присвойте деление чисел 
// (c,d)
// const myAge = 32;
// const currentYear = 2023;
// const sum = myAge + currentYear;
// const dif = currentYear - myAge;
// const multi = currentYear * myAge;
// const div = currentYear / myAge;

// 2. Выведите в консоль все созданные переменные
// console.log(myAge);
// console.log(currentYear);
// console.log(sum);
// console.log(dif);
// console.log(multi);
// console.log(div);

// 3. Сложите все созданные переменные и выведите результат в 
// консоль
// console.log(myAge + currentYear + sum + dif + multi + div);

// Задание 4 (тайминг 10 минут)
// 1. Не запуская код, определите, что выведется в консоль: 
// a. let a = 5 + 5 * 3 + 3;
// 2. Не запуская код, определите, что выведется в консоль:
// a. let a = 8 / 2 + 2;
// 3. Не запуская код, определите, что выведется в консоль:
// a. let a = (2 + 3) * (2 + 3);
// 4. Не запуская код, определите, что выведется в консоль:
// a. let a = (2 + 3) * 2 + 3;
// 5. Не запуская код, определите, что выведется в консоль:
// a. let a = (2 * 8) / 4;
// 6. Не запуская код, определите, что выведется в консоль:
// a. let a = 2 * (8 / 4);

// Задание 5 (тайминг 5 минут)
// 1. Запишите в переменную a число 1.5, а в переменную b - число 0.75.
// Найдите сумму значений этих переменных и выведите ее на экран.
// const a = 0.1;
// const b = 0.2;
// console.log(a + b);

// const d = 124324.32465;
// console.log(Math.round(d)); // до целого по правилам математики
// console.log(Math.floor(d)); // округляет вниз
// console.log(Math.ceil(d));  // округляет вверх
// console.log(Math.trunc(d)); // отбрасывает дробную часть
// console.log(d);
// console.log(Math.round(d * 100) / 100);
// console.log(d.toFixed(2));

// 2. Создайте переменную a, запишите в нее какое-нибудь 
// положительное или отрицательное число. Выведите на экран это 
// число с обратным знаком.
// const c = 5;
// console.log(-c);

// Задание 6 (тайминг 15 минут)
// 1. Создайте строку с вашем именем и строку с вашей фамилией. 
// Выведите эти данные в консоль
// const name = 'Dmitriy';
// const surname = 'Gavrilov';
// console.log(name + ' ' + surname);

// 2. Создайте переменную с текстом 'java' и переменную с текстом 
// 'script'. С помощью этих переменных и операции сложения строк 
// выведите в консоль строку 'javascript'.
// const string = 'java';
// const string2 = 'script';
// console.log(string + string2);

// 3. Создайте переменную с текстом 'hello' и переменную с текстом 
// 'world'. С помощью этих переменных и операции сложения строк 
// выведите в консоль строку 'hello world'.
// const string3 = 'hello';
// const string4 = 'world';
// console.log(`${string3} ${string4}`);

// let num = 5;
// console.log(num);
// num = 10;
// console.log(num);
// console.log(num ** 2);

// Типы данных
// number
// bigint
// let num1 = 2378652853918726473246123874156456538765634528653n;
// string
// boolean
// object
// undefined
// let num2;
// null
// let num3 = null;
// symbol - уникальное значение
